[
    {
      "response_type": "greeting",
      "user_input": ["hello", "hi", "hey"],
      "bot_response": "Hey there!",
      "required_words": []
    },
    {
      "response_type": "greeting",
      "user_input": ["see you", "goodbye", "bye"],
      "bot_response": "See you later!",
      "required_words": []
    },
    {
      "response_type": "greeting",
      "user_input": ["nice", "to", "meet", "you"],
      "bot_response": "The pleasure is all mine!",
      "required_words": ["nice", "meet", "you"]
    },
    {
      "response_type": "question",
      "user_input": ["how", "are", "you"],
      "bot_response": "I'm great! Thanks for asking.",
      "required_words": ["how", "are", "you"]
    },
        {
      "response_type": "info",
      "user_input": ["tell", "me", "about", "adak"],
      "bot_response": [
          [
              "ADAK, the Anti-Doping Agency of Kenya, is committed to a comprehensive anti-doping program.",
              "We engage with athletes, coaches, and the sports community to educate and promote anti-doping values.",
              "Our goal is to create a fair and competitive sporting environment in Kenya."
          ]
      ],
      "required_words": ["about", "adak"]
    },
    {
      "response_type": "info",
      "user_input": ["mandate"],
      "bot_response": [
          [
            "1. EDUCATION & PREVENTION",
            "The World Anti-Doping Agency offers many different tools to assist stakeholders with their education programs and help them educate target groups with suitable activities. There are tool kits of activities customized for Coaches, Teachers, Program Officers and Sport Physicians, and many different brochures providing anti-doping information.\n",
            
            "2. INTELLIGENCE AND INVESTIGATIONS",
            "The Intelligence and Investigations Team plays a critical role in the fight against doping.",
            "It is now fully recognized that, gathering insights, intelligence and information followed by a rigorous investigative approach is how we will catch more of those who attempt to undermine the values of fair play and sportsmanship.\n",

            "3. MODEL RULES, GUIDELINES AND PROTOCOLS",
            "WADA has developed Model Rules for National Olympic Committees, International Federations, Major Event Organizations and National Anti-Doping Organizations in order to assist these organizations in drafting anti-doping rules in line with the World Anti-Doping Code.\n",

            "4. CODE COMPLIANCE",
            "As the international independent Agency tasked with coordinating, monitoring and promoting the fight against doping in sport, one of WADA’s core activities is to monitor the compliance to the Code of its Signatories."
          ]
      ],
      "required_words": ["your", "mandate"]
    },
    {
      "response_type": "question",
      "user_input": ["what", "is", "your", "vision"],
      "bot_response": "The Anti-Doping Agency of Kenya (ADAK) vision is to be a world class Anti-Doping Agency, protecting clean athletes and promoting fair play.",
      "required_words": ["vision"]
    },
    {
      "response_type": "question",
      "user_input": ["core", "principles", "values"],
      "bot_response": [
          [
            "1. Equity and Equality",
            "2. Impartiality",
            "3. Integrity, Transparency and Accountability",
            "4. Inclusiveness"
          ]
      ],
      "required_words": ["core", "principles", "values"]
    },
    {
      "response_type": "question",
      "user_input": ["what", "is", "your", "mission"],
      "bot_response": "To lead a coordinated national anti-doping education and awareness campaign, testing and promotion of integrity for doping-free sport.",
      "required_words": ["mission"]
    },
     {
        "response_type": "info",
        "user_input": ["what", "are", "anti-doping", "rule", "violations"],
        "bot_response": [
            [
                "Anti-Doping Rule Violations (ADRVs) are infractions related to doping that can be committed by athletes or Athlete Support Personnel (ASP).",
                "ADRVs include actions like the presence of a Prohibited Substance, Use of Prohibited Substances or Methods, Evading Sample Collection, Whereabouts Failures, Tampering with Doping Control, and more.",
                "These violations can lead to sanctions and ineligibility in sports governed by the World Anti-Doping Code."
            ]
        ],
        "required_words": ["anti-doping", "rule", "violations"]
    },
    {
        "response_type": "info",
        "user_input": ["what", "is", "presence", "of", "a", "prohibited", "substance"],
        "bot_response": [
            [
                "The 'Presence of a Prohibited Substance' occurs when a sample (urine or blood) contains a Prohibited Substance, its Metabolite(s), or Marker(s).",
                "Proof is established through the analysis of sample A, confirmation by sample B, or the second bottle of split sample A.",
                "No intent, Fault, Negligence, or knowing Use needs to be demonstrated for this violation."
            ]
        ],
        "required_words": ["presence", "of", "a", "prohibited", "substance"]
    },
    {
        "response_type": "info",
        "user_input": ["how", "is", "use", "of", "a", "prohibited", "substance", "established"],
        "bot_response": [
            [
                "The 'Use or Attempted Use of a Prohibited Substance' can be proven by admission, witness statements, documentary evidence, or longitudinal profiling.",
                "Proof of intent is required, but even without intent, the Principle of Strict Liability applies."
            ]
        ],
        "required_words": ["use", "of", "a", "prohibited", "substance"]
    },
    {
        "response_type": "info",
        "user_input": ["what", "is", "evading", "or", "refusing", "sample", "collection"],
        "bot_response": [
            [
                "Evading Sample Collection means avoiding a Doping Control Official to avoid testing.",
                "Refusing means intentionally not submitting to sample collection after notification without a compelling justification.",
                "Failing to submit means not providing a sample, either intentionally or negligently."
            ]
        ],
        "required_words": ["evading", "refusing", "sample", "collection"]
    },
    {
        "response_type": "info",
        "user_input": ["what", "are", "whereabouts", "failures"],
        "bot_response": [
            [
                "Whereabouts Failures apply to athletes in a Registered Testing Pool (RTP).",
                "A missed test occurs if an athlete is not present at the indicated location.",
                "A filing failure is recorded if the athlete fails to provide or update whereabouts information.",
                "Three missed tests or filing failures in twelve months result in an ADRV."
            ]
        ],
        "required_words": ["whereabouts", "failures"]
    },
    {
        "response_type": "info",
        "user_input": ["what", "is", "tampering", "with", "doping", "control"],
        "bot_response": [
            [
                "Tampering with Doping Control involves intentional actions that subvert the Doping Control process.",
                "This includes offering or accepting bribes, preventing sample collection, falsifying documents, and other similar actions."
            ]
        ],
        "required_words": ["tampering", "with", "doping", "control"]
    },
    {
        "response_type": "info",
        "user_input": ["what", "is", "possession", "of", "a", "prohibited", "substance"],
        "bot_response": [
            [
                "Possession of a Prohibited Substance or Method involves having such items without a valid reason.",
                "Valid reasons include having a Therapeutic Use Exemption (TUE), prescription from a qualified doctor, or medication for a sick person."
            ]
        ],
        "required_words": ["possession", "of", "a", "prohibited", "substance"]
    },
    {
        "response_type": "info",
        "user_input": ["what", "is", "trafficking", "of", "prohibited", "substances"],
        "bot_response": [
            [
                "Trafficking or Attempted Trafficking involves selling, giving, or distributing Prohibited Substances or Methods.",
                "This applies to athletes, ASPs, or any person subject to anti-doping authority.",
                "In Kenya, trafficking is also a criminal offense with potential legal consequences."
            ]
        ],
        "required_words": ["trafficking", "of", "prohibited", "substances"]
    },
    {
        "response_type": "info",
        "user_input": ["what", "is", "administration", "of", "a", "prohibited", "substance"],
        "bot_response": [
            [
                "Administration or Attempted Administration involves providing or facilitating the Use of Prohibited Substances or Methods by others.",
                "This does not include actions by legitimate medical personnel for genuine therapeutic purposes."
            ]
        ],
        "required_words": ["administration", "of", "a", "prohibited", "substance"]
    },
    {
        "response_type": "info",
        "user_input": ["what", "is", "complicity"],
        "bot_response": [
            [
                "Complicity involves assisting, encouraging, or conspiring with someone involved in an ADRV.",
                "This includes aiding or covering up violations or non-compliance with the Code."
            ]
        ],
        "required_words": ["complicity"]
    },
    {
        "response_type": "info",
        "user_input": ["what", "is", "prohibited", "association"],
        "bot_response": [
            [
                "Prohibited Association is working with or being associated with an ASP who is under sanction.",
                "This includes obtaining training, advice, or treatment from someone who is sanctioned or convicted related to doping."
            ]
        ],
        "required_words": ["prohibited", "association"]
    },
    {
        "response_type": "info",
        "user_input": ["what", "is", "discouragement", "of", "reporting"],
        "bot_response": [
            [
                "Discouraging or Retaliating Against Reporting involves threatening or intimidating someone to prevent them from reporting an ADRV.",
                "It also includes retaliation against anyone who has reported an ADRV or non-compliance with the Code."
            ]
        ],
        "required_words": ["discouragement", "of", "reporting"]
    },
        {
        "response_type": "info",
        "user_input": ["doping", "sanctions"],
        "bot_response": [
            [
                "1: Presence, Use or Attempted Use and Possession of a prohibited substance or method.",
                "Any of the above three ADRVs will attract a sanction of 4 years. However, the sanction may be reduced to 2 years if:",
                "(a) Athlete tests positive for (or uses/possesses) Non-Specified Substance but shows ADRV was not ‘intentional’.",
                "(b) Athlete tests positive for (or uses/possesses) Specified Substance but ADO cannot show use was ‘intentional’.",
                "2: Evading, Refusing or Failing to submit to sample collection and Tampering or Attempted Tampering.",
                "Any of the above ADRVs will attract a sanction of 4 years. However, the sanction may be reduced to 2 years if the athlete shows ADRV was not ‘intentional’.",
                "Tampering or Attempted Tampering attracts a double sanction for an athlete already serving a Period of Ineligibility.",
                "3: Failure to file athlete whereabouts information and missed test.",
                "Committing this ADRV will lead to a sanction of 2 years subject to a reduction to a minimum of 1 year depending on the athlete’s degree of fault.",
                "4: Trafficking and Administration of prohibited substance or methods.",
                "Any of the above ADRVs will attract a sanction of a minimum of 4 years to a lifetime depending on the seriousness of the violation.",
                "5: Complicity.",
                "The sanction for this shall be a minimum of 2 years up to 4 years depending on the seriousness of the violation.",
                "6: Prohibited Association.",
                "The sanction for this shall be 2 years, subject to reduction down to a minimum of 1 year depending on the degree of fault or other circumstances of the case.",
                "7: Discouraging or Retaliating.",
                "The sanction depends on the seriousness of the violation committed.",
                "Elimination of Sanction.",
                "A sanction can be eliminated if an athlete or Other Persons establishes that they bear no fault or negligence.",
                "Possible Reduction of Sanction.",
                "A sanction can be reduced based on no Significant fault or negligence under the following: Specified Substances, Contaminated Products, Substantial Assistance, Admission, Protected Persons or Recreational Athletes.",
                "VIDEO: https://youtu.be/Hxq6xCa8Dm8"
            ]
        ],
        "required_words": ["sanctions"]
    },
    {
        "response_type": "info",
        "user_input": ["what", "is", "results", "management"],
        "bot_response": [
            [
                "Results Management (RM) refers to the process designed to resolve Anti-Doping Rule Violation (ADRV) matters in a fair, expeditious, and efficient manner.",
                "The process of RM encompasses the timeframe between notification, or in certain cases (e.g Atypical Finding, Athlete Biological Passport (ABP), Whereabouts Failure) such pre-notification steps through the charge until the final resolution of the matter, including the end of the hearing process at first instance or on appeal.",
                "Results Management shall be the responsibility of, and shall be governed by the procedural rules of, the Anti-Doping Organization (ADO) that initiated and directed Sample collection.",
                "If no Sample collection is involved, the ADO which first provides notice to an Athlete or other Person of a potential ADRV has the responsibility to diligently pursue that ADRV.",
                "General Principles of Results Management:",
                "i. Confidentiality: All processes and procedures related to RM are confidential, except for disclosures that are required or permitted under the Code and the International Standard on Results Management (ISRM).",
                "ii. Timeliness: In the interest of fair and effective sport justice, Anti-Doping Rule Violations (ADRVs) are to be prosecuted in a timely manner. Irrespective of the type of ADRV involved, ADOs should be able to conclude Results Management (including the Hearing Process at first instance) within six (6) months from the notification, except for cases involving complex issues or delays not in the control of the ADOs."
            ]
        ],
        "required_words": ["results", "management"]
    }
  ]
